package xyz.itwill.util;

import java.util.Scanner;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

//Á¤±ÔÇ¥Çö½Ä(Regular Expression) : Meta ¹®ÀÚ, Escape ¹®ÀÚ µîÀ» ÀÌ¿ëÇÏ¿© ÀÏÁ¤ÇÑ ±ÔÄ¢ÀÇ ¹®ÀÚ¿­À» Ç¥ÇöÇÏ´Â ¹æ¹ı
/*
 ^¹®ÀÚ : ¹®ÀÚ(¿­)·Î ½ÃÀÛµÊÀ» ÀÇ¹Ì
 ¹®ÀÚ$ : ¹®ÀÚ(¿­)·Î Á¾·áµÊÀ» ÀÇ¹Ì
 . : ÀÓÀÇÀÇ ¹®ÀÚ ÇÏ³ª¸¦ ÀÇ¹Ì(\ ¹®ÀÚ Ç¥Çö ºÒ°¡´É)
 [¹®ÀÚ1¹®ÀÚ2¹®ÀÚ3] : ³ª¿­µÈ ¹®ÀÚµé Áß ÇÏ³ª¸¦ ÀÇ¹Ì
 [^¹®ÀÚ1¹®ÀÚ2¹®ÀÚ3] : ³ª¿­µÈ ¹®ÀÚµéÀÌ ¾Æ´Ñ ¹®ÀÚµé Áß ÇÏ³ª¸¦ ÀÇ¹Ì
 [¹®ÀÚ1-¹®ÀÚ2] : ¹®ÀÚ1ºÎÅÍ ¹®ÀÚ2 ¹üÀ§ÀÇ ¹®ÀÚ Áß ÇÏ³ª¸¦ ÀÇ¹Ì
 [¹®ÀÚ¿­|¹®ÀÚ¿­|¹®ÀÚ¿­] : ³ª¿­µÈ ¹®ÀÚ¿­µé Áß ÇÏ³ª¸¦ ÀÇ¹Ì
 ¹®ÀÚ¿­+ : ¹®ÀÚ¿­ÀÌ 1¹ø ÀÌ»ó ¹İº¹µÊÀ» ÀÇ¹Ì
 ¹®ÀÚ¿­* : ¹®ÀÚ¿­ÀÌ 0¹ø ÀÌ»ó ¹İº¹µÊÀ» ÀÇ¹Ì
 ¹®ÀÚ¿­? : ¹®ÀÚ¿­ÀÌ 0¹ø ¶Ç´Â 1¹ø Á¸ÀçÇÔÀ» ÀÇ¹Ì
 ¹®ÀÚ¿­{¼ıÀÚ} : ¹®ÀÚ¿­ÀÌ ¼ıÀÚ¸¸Å­ ¹İº¹µÊÀ» ÀÇ¹Ì
 ¹®ÀÚ¿­{¼ıÀÚ1,¼ıÀÚ2} : ¹®ÀÚ¿­ÀÌ ¼ıÀÚ1ºÎÅÍ ¼ıÀÚ2¸¸Å­ ¹İº¹µÊÀ» ÀÇ¹Ì
 (?!)¹®ÀÚ¿­ : ¹®ÀÚ¿­¿¡¼­ ´ë¼Ò¹®ÀÚ¸¦ ±¸ºĞÇÏÁö ¾ÊÀ½À» ÀÇ¹Ì
 (?=¹®ÀÚ¿­) : ¹®ÀÚ¿­À» ¹İµå½Ã Æ÷ÇÔÇÏ°í ÀÖÀ½À» ÀÇ¹Ì
 (?!=¹®ÀÚ¿­) : ¹®ÀÚ¿­À» ¹İµå½Ã Æ÷ÇÔÇÏ°í ÀÖÁö ¾ÊÀ½À» ÀÇ¹Ì
 
 \s : °ø¹éÀÌ Á¸ÀçÇÏ´Â ¹®ÀÚ¿­À» ÀÇ¹Ì
 \S : °ø¹éÀÌ Á¸ÀçÇÏÁö ¾Ê´Â ¹®ÀÚ¿­À» ÀÇ¹Ì
 \w : ¿µ¹®ÀÚ, ¼ıÀÚ, Æ¯¼ö¹®ÀÚ(_)ÀÇ ¹®ÀÚ·Î¸¸ ±¸¼ºµÈ ¹®ÀÚ¿­À» ÀÇ¹Ì
 \W : ¿µ¹®ÀÚ, ¼ıÀÚ, Æ¯¼ö¹®ÀÚ(_)ÀÇ ¹®ÀÚ¸¦ Á¦¿ÜÇÑ ¹®ÀÚµé·Î ±¸¼ºµÈ ¹®ÀÚ¿­À» ÀÇ¹Ì
 \d : ¼ıÀÚ ÇüÅÂÀÇ ¹®ÀÚ·Î¸¸ ±¸¼ºµÇ´Â ¹®ÀÚ¿­À» ÀÇ¹Ì
 \D : ¼ıÀÚ ÇüÅÂÀÇ ¹®ÀÚ¸¦ Á¦¿ÜÇÑ ¹®ÀÚµé·Î ±¸¼ºµÇ´Â ¹®ÀÚ¿­À» ÀÇ¹Ì
 \¸ŞÅ¸¹®ÀÚ : ¸ŞÅ¸¹®ÀÚ¸¦ ÀÏ¹İ¹®ÀÚ·Î Ç¥Çö
 */

//Å°º¸µå·Î ÀÔ·ÂµÈ ¹®ÀÚ¿­¿¡ ´ëÇÑ °ËÁõ ÇÁ·Î±×·¥
// => Çü½Ä¿¡ ¸ÂÁö ¾ÊÀº ¹®ÀÚ¿­À» ÀÔ·ÂÇÑ °æ¿ì ÇÁ·Î±×·¥ Á¾·á - À¯È¿¼º °Ë»ç
public class ValidationApp {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);
		
		System.out.print("¾ÆÀÌµğ ÀÔ·Â >> ");
		String id = in.nextLine();
		
		//ÀÔ·Â°ª Á¸Àç¿¡ ´ëÇÑ °ËÁõ - ¿¬»êÀÚ ¶Ç´Â ¸Ş¼Òµå¸¦ ÀÌ¿ëÇÑ À¯È¿¼º °ËÁõ
		if(id == null || id.equals("")) {
			System.out.println("[¿¡·¯]¾ÆÀÌµğ¸¦ ¹İµå½Ã ÀÔ·ÂÇØÁÖ¼¼¿ä");
			System.exit(0);
		}
		
		//ÀÔ·Â°ª Çü½Ä¿¡ ´ëÇÑ °ËÁõ - Á¤±ÔÇ¥Çö½ÄÀ» ÀÌ¿ëÇÑ À¯È¿¼º °Ë»ç
		//¾ÆÀÌµğ ÀÔ·Â ±ÔÄ¢ - ¿µ¹®ÀÚ·Î ½ÃÀÛµÇ¸ç ¿µ¹®ÀÚ, ¼ıÀÚ, Æ¯¼ö¹®ÀÚ(_)ÀÇ Á¶ÇÕÀ¸·Î 6~20 ¹üÀ§ÀÇ ¹®ÀÚ·Î Ç¥Çö
		
		//java.util.regex.Pattern : Á¤±ÔÇ¥Çö½ÄÀ» ÀúÀåÇÏ±â À§ÇÑ Å¬·¡½º
		//Pattern.matches(String regex, CharSequence input) : Á¤±Ô Ç¥Çö½Ä°ú ÀÔ·Â°ªÀ»
		//Àü´Ş¹Ş¾Æ ±ÔÄ¢À» ºñ±³ÇÏ¿© °á°ú¸¦ ¹İÈ¯ÇÏ´Â ¸Ş¼Òµå
		// => false : ºÒÀÏÄ¡, true : ÀÏÄ¡
		/*
		if(!Pattern.matches("^[a-zA-Z][a-zA-z0-9_]{5,19}$", id)) {
			System.out.println("[¿¡·¯]ÀÔ·ÂÇÑ ¾ÆÀÌµğ´Â Çü½Ä¿¡ ¸ÂÁö ¾Ê½À´Ï´Ù.");
			System.exit(0);
		}
		*/
		
		//Pattern.compile(String regex) : Á¤±Ô Ç¥Çö½ÄÀ» Àü´Ş¹Ş¾Æ Pattern ÀÎ½ºÅÏ½º¿¡ ÀúÀåÇÏ¿© ¹İÈ¯ÇÏ´Â ¸Ş¼Òµå
		Pattern idPattern = Pattern.compile("^[a-zA-Z]\\w{5,19}$");
		
		//java.util.regex.Matcher : Á¤±Ô Ç¥Çö½Ä°ú ºñ±³ ¹®ÀÚ¿­À» ÀúÀåÇÏ±â À§ÇÑ Å¬·¡½º
		// => Á¤±Ô Ç¥Çö½Ä°ú ¹®ÀÚ¿­À» ºñ±³ÇÏ´Â ±â´É ¿Ü º¯°æ ¶Ç´Â »èÁ¦ Ã³¸®ÇÏ´Â ±â´É Á¦°ø
		//Pattern.matcher(CharSeqence input) : Pattern ÀÎ½ºÅÏ½º¿¡ ÀúÀåµÈ Á¤±Ô Ç¥Çö½Ä¿¡
		//ºñ±³ ¹®ÀÚ¿­À» Á¦°ø¹Ş¾Æ ÀúÀåÇÑ Matcher ÀÎ½ºÅÏ½º¸¦ ¹İÈ¯ÇÏ´Â ¸Ş¼Òµå
		Matcher idMatcher = idPattern.matcher(id);
		
		//Matcher.matches() : Matcher ÀÎ½ºÅÏ½º¿¡ ÀúÀåµÈ Á¤±Ô Ç¥Çö½Ä°ú ¹®ÀÚ¿­¿¡ ´ëÇÑ ±ÔÄ¢À» ºñ±³ÇÏ¿©
		//°á°ú¸¦ ¹İÈ¯ÇÏ´Â ¸Ş¼Òµå - false : ºÒÀÏÄ¡, true : ÀÏÄ¡
		if(!idMatcher.matches()) {
			System.out.println("[¿¡·¯]ÀÔ·ÂÇÑ ¾ÆÀÌµğ´Â Çü½Ä¿¡ ¸ÂÁö ¾Ê½À´Ï´Ù.");
			System.exit(0);
		}
		
		System.out.println("[¸Ş½ÃÁö]Çü½Ä¿¡ ¸Â´Â ¾ÆÀÌµğ¸¦ ÀÔ·Â ÇÏ¿´½À´Ï´Ù.");
		
		/*
		System.out.print("ºñ¹Ğ¹øÈ£ ÀÔ·Â >> ");
		String password = in.nextLine();
		
		if(password == null || password.equals("")) {
			System.out.println("[¿¡·¯]ºñ¹Ğ¹øÈ£¸¦ ¹İµå½Ã ÀÔ·ÂÇØÁÖ¼¼¿ä");
			System.exit(0);
		}
		
		//ºñ¹Ğ¹øÈ£ ±ÔÄ¢ - ¿µ¹®ÀÚ, ¼ıÀÚ, Æ¯¼ö¹®ÀÚ¸¦ ¹İµå½Ã 1°³ ÀÌ»ó Æ÷ÇÔÇÏ¿© 8 ~ 30 ¹üÀ§ÀÇ ¹®ÀÚ·Î ¼³Á¤
		String passwordReg = "^(?=.*[a-zA-Z])(?=.*[0-9])(?=.*[~!@#$%^&*_-]).{8,30}$";
		if(!Pattern.matches(passwordReg, password)) {
			System.out.println("[¿¡·¯]ÀÔ·ÂÇÑ ºñ¹Ğ¹øÈ£°¡ Çü½Ä¿¡ ¸ÂÁö ¾Ê½À´Ï´Ù.");
			System.exit(0);
		}
		
		System.out.println("[¸Ş½ÃÁö]Çü½Ä¿¡ ¸Â´Â ºñ¹Ğ¹øÈ£¸¦ ÀÔ·Â ÇÏ¿´½À´Ï´Ù.");
		*/
		
		System.out.print("ÀÌ¸ŞÀÏ ÀÔ·Â >> ");
		String email = in.nextLine();
		
		if(email == null || email.equals("")) {
			System.out.println("[¿¡·¯]ÀÌ¸ŞÀÏÀ» ¹İµå½Ã ÀÔ·ÂÇØÁÖ¼¼¿ä");
			System.exit(0);
		}
		
		//ÀÌ¸ŞÀÏ ±ÔÄ¢ - [»ç¿ëÀÚ¸í@µµ¸ŞÀÎ¸í] Çü½ÄÀÇ ¹®ÀÚ¿­·Î Ç¥Çö
		String emailReg = "^([a-zA-Z0-9_-]+@[a-zA-Z0-9_-]+(\\.[a-zA-Z0-9_-]+)+)*$";
		if(!Pattern.matches(emailReg, email)) {
			System.out.println("[¿¡·¯]ÀÔ·ÂÇÑ ÀÌ¸ŞÀÏÀÌ Çü½Ä¿¡ ¸ÂÁö ¾Ê½À´Ï´Ù.");
			System.exit(0);
		}
		
		System.out.println("[¸Ş½ÃÁö]Çü½Ä¿¡ ¸Â´Â ÀÌ¸ŞÀÏÀ» ÀÔ·Â ÇÏ¿´½À´Ï´Ù.");
		
		in.close();
		
		//Âü°í) ÀÌ¸§ °ËÁõ : ^[°¡-ÆR]{2,10}$
	}
}
